{
  "title": "Elementary Geometry Fundamentals: A 10-Day Journey from Visual Recognition to Logical Reasoning",
  "daily_modules": [
    {
      "day": 1,
      "date": "2025-06-29",
      "title": "Geometric Foundations and Visual Recognition",
      "key_insights": [
        "Geometry bridges abstract mathematical thinking with concrete spatial experience",
        "Visual recognition is the foundation for all geometric learning",
        "Mathematical precision builds upon natural spatial intuition"
      ],
      "core_concepts": [
        "What geometry studies: shapes, space, and relationships",
        "Visual recognition vs. mathematical definition",
        "Geometry in nature and human-made objects",
        "Spatial thinking and geometric intuition"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Mathematical geometry to real-world spatial experiences",
        "explain": "How geometry connects to everyday objects and spatial relationships",
        "awareness": "Geometry as both abstract mathematical concepts and practical spatial knowledge",
        "recognize": "Basic geometric shapes and their visual characteristics",
        "understand": "Distinguish between geometric and non-geometric objects in the physical world"
      },
      "practical_connections": "Observe and catalog geometric shapes in your immediate environment, noting how mathematical concepts appear in architecture, nature, and everyday objects. Practice distinguishing between approximate visual similarity and exact mathematical relationships.",
      "primary_reading_focus": "Introduction to geometry as a mathematical discipline, basic geometric vocabulary, and the role of visualization in mathematical thinking",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780130309631",
          "year": "2001",
          "focus": "Hands-on exploration of spatial concepts and geometric intuition development",
          "title": "Experiencing Geometry - Introduction to Geometric Thinking",
          "author": "David W. Henderson",
          "journal": "Book Chapter",
          "publisher": "Prentice Hall",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 2,
      "date": "2025-06-30",
      "title": "Points, Lines, and Planes: The Building Blocks",
      "key_insights": [
        "Geometric objects are idealizations that allow precise mathematical reasoning",
        "Notation and terminology provide the language for geometric communication",
        "Postulates establish the logical foundation for all geometric conclusions"
      ],
      "core_concepts": [
        "Points as locations without dimension",
        "Lines as infinite one-dimensional objects",
        "Planes as infinite two-dimensional surfaces",
        "Rays, segments, and their directed nature",
        "Intersections and geometric relationships"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Abstract geometric concepts to physical representations and models",
        "explain": "How these basic elements combine to form all geometric figures",
        "awareness": "The role of undefined terms and postulates in building geometric knowledge",
        "recognize": "Different types of lines, rays, segments, and their relationships",
        "understand": "Points, lines, and planes as fundamental geometric objects with specific mathematical properties"
      },
      "practical_connections": "Create physical models using string for lines, paper for planes, and dots for points. Practice geometric notation by labeling objects in your environment and describing their relationships using mathematical language.",
      "primary_reading_focus": "Fundamental geometric objects, notation systems, postulates about points and lines, and the axiomatic foundation of geometry",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780977985203",
          "year": "2006",
          "focus": "Classical presentation of geometric fundamentals with rigorous logical development",
          "title": "Kiselev's Geometry - Basic Concepts and Definitions",
          "author": "A. P. Kiselev",
          "journal": "Book Chapter",
          "publisher": "Sumizdat",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 3,
      "date": "2025-07-01",
      "title": "Angles: Formation, Measurement, and Relationships",
      "key_insights": [
        "Angles quantify the amount of rotation or turn between two directions",
        "Angle relationships provide tools for solving geometric problems",
        "Precise measurement enables mathematical analysis of geometric figures"
      ],
      "core_concepts": [
        "Angle formation by intersecting rays",
        "Angle measurement in degrees",
        "Acute, obtuse, right, and straight angles",
        "Complementary and supplementary angle pairs",
        "Vertical angles and linear pairs"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Angle concepts to rotation, direction, and spatial orientation",
        "explain": "Different types of angles and their measurement using degrees",
        "awareness": "The importance of angle measurement in describing geometric relationships",
        "recognize": "Angle relationships including complementary, supplementary, and vertical angles",
        "understand": "Angles as geometric figures formed by two rays sharing a common endpoint"
      },
      "practical_connections": "Use a protractor to measure angles in your environment. Create angle pairs with your hands, books, or other objects to explore complementary and supplementary relationships. Practice estimating angle measures before measuring them.",
      "primary_reading_focus": "Angle definition, classification systems, measurement techniques, and fundamental angle relationships in geometric figures",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780130309631",
          "year": "2001",
          "focus": "Hands-on activities for understanding angle formation and measurement",
          "title": "Experiencing Geometry - Angle Exploration Activities",
          "author": "David W. Henderson",
          "journal": "Book Chapter",
          "publisher": "Prentice Hall",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 4,
      "date": "2025-07-02",
      "title": "Triangles: Properties and Classification",
      "key_insights": [
        "Triangles serve as fundamental building blocks for understanding all polygons",
        "Classification systems help organize and analyze geometric properties",
        "The triangle angle sum theorem provides a powerful tool for geometric reasoning"
      ],
      "core_concepts": [
        "Triangle definition and basic properties",
        "Classification by side lengths: equilateral, isosceles, scalene",
        "Classification by angles: acute, obtuse, right triangles",
        "Angle sum property of triangles",
        "Triangle inequality principle"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Triangle properties to real-world applications and other geometric concepts",
        "explain": "Different triangle classification systems based on sides and angles",
        "awareness": "The fundamental role of triangles in geometric reasoning and measurement",
        "recognize": "Isosceles, equilateral, scalene, acute, obtuse, and right triangles",
        "understand": "Triangles as three-sided polygons with specific angle and side relationships"
      },
      "practical_connections": "Identify different types of triangles in architectural elements, art, and nature. Practice measuring triangle angles to verify the angle sum property. Create triangles using straws or sticks to explore the triangle inequality.",
      "primary_reading_focus": "Triangle definitions, classification systems, fundamental properties including angle sum theorem, and geometric reasoning with triangular figures",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780395470923",
          "year": "1991",
          "focus": "Problem-solving approaches to triangle properties and applications",
          "title": "Geometry for Enjoyment and Challenge - Triangle Explorations",
          "author": "Richard Rhoad, George Milauskas, and Robert Whipple",
          "journal": "Book Chapter",
          "publisher": "McDougal Littell",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 5,
      "date": "2025-07-03",
      "title": "Polygons and Quadrilaterals: Shape Families",
      "key_insights": [
        "Polygon families are organized by increasingly specific geometric properties",
        "Understanding relationships between quadrilaterals reveals the logical structure of geometry",
        "Special properties of regular polygons make them particularly useful in applications"
      ],
      "core_concepts": [
        "Polygon definition and classification by number of sides",
        "Regular vs. irregular polygons",
        "Quadrilateral family: parallelograms, rectangles, rhombuses, squares",
        "Special quadrilateral properties: parallel sides, equal sides, right angles",
        "Diagonal relationships in quadrilaterals"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Polygon classification to practical applications in design and construction",
        "explain": "Quadrilateral family relationships including parallelograms, rectangles, rhombuses, and squares",
        "awareness": "How geometric properties determine the relationships between different polygon types",
        "recognize": "Regular vs. irregular polygons and special quadrilateral properties",
        "understand": "Polygons as closed figures formed by line segments, with specific properties based on the number of sides"
      },
      "practical_connections": "Explore polygon shapes in floor tiles, window designs, and architectural features. Use geometric tools to verify properties of quadrilaterals such as parallel sides and right angles. Create a family tree showing relationships between different quadrilaterals.",
      "primary_reading_focus": "Polygon classification systems, quadrilateral family relationships, properties of special quadrilaterals, and geometric reasoning with multi-sided figures",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780977985203",
          "year": "2006",
          "focus": "Classical treatment of polygon properties with emphasis on logical relationships",
          "title": "Kiselev's Geometry - Polygons and Quadrilaterals",
          "author": "A. P. Kiselev",
          "journal": "Book Chapter",
          "publisher": "Sumizdat",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 6,
      "date": "2025-07-04",
      "title": "Circles: Curved Geometry and Central Concepts",
      "key_insights": [
        "Circles represent perfect symmetry and have unique geometric properties",
        "Understanding radius-diameter relationships provides tools for circle calculations",
        "Circle concepts connect geometry to measurement and real-world applications"
      ],
      "core_concepts": [
        "Circle definition based on equidistant points",
        "Radius, diameter, and their relationship",
        "Chords, arcs, and central angles",
        "Circumference and its relationship to diameter",
        "Tangent lines and secant lines"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Circle concepts to rotational motion, periodic phenomena, and design applications",
        "explain": "Circle terminology including radius, diameter, chord, arc, and circumference",
        "awareness": "The unique properties that distinguish circles from polygonal figures",
        "recognize": "Relationships between circle parts and their geometric properties",
        "understand": "Circles as the set of all points equidistant from a central point"
      },
      "practical_connections": "Use a compass to construct circles and explore the relationship between radius and circumference. Identify circular objects in your environment and measure their dimensions to verify geometric relationships. Practice using circle terminology to describe curved objects.",
      "primary_reading_focus": "Circle definitions, fundamental terminology, relationships between circle elements, and basic properties of circular geometry",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780130309631",
          "year": "2001",
          "focus": "Hands-on exploration of circle properties through construction and measurement activities",
          "title": "Experiencing Geometry - Exploring Circles",
          "author": "David W. Henderson",
          "journal": "Book Chapter",
          "publisher": "Prentice Hall",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 7,
      "date": "2025-07-05",
      "title": "Spatial Relationships and Coordinate Thinking",
      "key_insights": [
        "Coordinate systems provide precise methods for describing spatial relationships",
        "Parallel and perpendicular relationships are fundamental to geometric analysis",
        "Transformations help understand how geometric objects relate to each other"
      ],
      "core_concepts": [
        "Distance between points and geometric objects",
        "Parallel and perpendicular line relationships",
        "Introduction to coordinate systems",
        "Relative position and direction",
        "Geometric transformations: translation, rotation, reflection"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Abstract spatial relationships to navigation, mapping, and practical applications",
        "explain": "Basic coordinate systems for describing location and spatial relationships",
        "awareness": "The importance of reference systems in describing geometric relationships",
        "recognize": "Parallel and perpendicular relationships, distance concepts, and relative positioning",
        "understand": "How geometric objects relate to each other in space through distance, position, and direction"
      },
      "practical_connections": "Practice describing locations using coordinate ideas like grid references. Use graph paper to plot points and explore distance relationships. Identify parallel and perpendicular elements in architectural structures and everyday objects.",
      "primary_reading_focus": "Spatial relationship concepts, distance and position measurement, parallel and perpendicular relationships, and introduction to coordinate geometry",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780395470923",
          "year": "1991",
          "focus": "Problem-solving activities that develop spatial reasoning and coordinate thinking",
          "title": "Geometry for Enjoyment and Challenge - Spatial Reasoning Problems",
          "author": "Richard Rhoad, George Milauskas, and Robert Whipple",
          "journal": "Book Chapter",
          "publisher": "McDougal Littell",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 8,
      "date": "2025-07-06",
      "title": "Congruence: Understanding Shape Equality",
      "key_insights": [
        "Congruence provides a precise mathematical definition for \"same size and shape\"",
        "Transformations help visualize and understand congruence relationships",
        "Congruence criteria offer systematic methods for proving geometric relationships"
      ],
      "core_concepts": [
        "Definition of congruent geometric figures",
        "Corresponding parts of congruent figures",
        "Congruence transformations: reflection, rotation, translation",
        "Triangle congruence postulates: SSS, SAS, ASA",
        "Congruence notation and symbolic representation"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Congruence concepts to practical applications in manufacturing, construction, and design",
        "explain": "Methods for determining when two geometric figures are congruent",
        "awareness": "The difference between visual similarity and mathematical congruence",
        "recognize": "Corresponding parts of congruent figures and congruence notation",
        "understand": "Congruence as geometric figures having the same size and shape"
      },
      "practical_connections": "Compare identical objects to understand congruence in real applications. Use tracing paper to explore congruence transformations. Practice identifying corresponding parts in congruent figures from everyday examples.",
      "primary_reading_focus": "Congruence definitions, identification of congruent figures, transformation concepts, and basic triangle congruence criteria",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780977985203",
          "year": "2006",
          "focus": "Classical treatment of congruence with emphasis on logical reasoning and proof concepts",
          "title": "Kiselev's Geometry - Congruence and Equality",
          "author": "A. P. Kiselev",
          "journal": "Book Chapter",
          "publisher": "Sumizdat",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 9,
      "date": "2025-07-07",
      "title": "Area and Perimeter: Quantifying Geometric Properties",
      "key_insights": [
        "Area and perimeter provide quantitative tools for analyzing geometric figures",
        "Measurement formulas connect geometric properties to numerical calculations",
        "Understanding units is essential for meaningful geometric measurement"
      ],
      "core_concepts": [
        "Perimeter as boundary length measurement",
        "Area as interior space measurement",
        "Formulas for rectangles, triangles, and circles",
        "Units of measurement: linear vs. square units",
        "Relationship between shape properties and measurements"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Area and perimeter concepts to real-world problems involving space, materials, and costs",
        "explain": "Methods for calculating area and perimeter of basic geometric shapes",
        "awareness": "How measurement connects geometric concepts to quantitative analysis",
        "recognize": "Units of measurement for area and perimeter, and their practical applications",
        "understand": "Area as the amount of space inside a figure and perimeter as the distance around the boundary"
      },
      "practical_connections": "Measure rooms, furniture, or outdoor spaces to practice area and perimeter calculations. Compare different shapes with the same perimeter but different areas. Use measurement to solve practical problems involving materials, space planning, or cost estimation.",
      "primary_reading_focus": "Area and perimeter definitions, measurement formulas for basic shapes, unit analysis, and applications of geometric measurement",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780130309631",
          "year": "2001",
          "focus": "Hands-on activities for discovering area and perimeter relationships through manipulation and construction",
          "title": "Experiencing Geometry - Measurement and Applications",
          "author": "David W. Henderson",
          "journal": "Book Chapter",
          "publisher": "Prentice Hall",
          "reading_time": "18 minutes"
        }
      ]
    },
    {
      "day": 10,
      "date": "2025-07-08",
      "title": "Integration and Geometric Reasoning",
      "key_insights": [
        "Geometric concepts form an interconnected network of mathematical relationships",
        "Problem-solving requires integrating multiple geometric tools and concepts",
        "Geometric reasoning skills transfer to many areas of mathematics and practical application"
      ],
      "core_concepts": [
        "Integrating shape properties, measurements, and relationships",
        "Geometric problem-solving strategies",
        "Connections between different geometric topics",
        "Applications of geometry in design, construction, and science",
        "Preparation for advanced geometric reasoning"
      ],
      "time_allocation": {
        "total": "60 minutes",
        "primary_text": "42 minutes",
        "supplementary_materials": "18 minutes"
      },
      "knowledge_benchmark": {
        "connect": "Geometric knowledge to advanced mathematical concepts and real-world applications",
        "explain": "Connections between different areas of geometry and their applications",
        "awareness": "Geometry as a foundation for further mathematical learning and practical problem-solving",
        "recognize": "Geometric reasoning patterns and problem-solving strategies",
        "understand": "How all geometric concepts work together to solve complex spatial problems"
      },
      "practical_connections": "Design a project that combines multiple geometric concepts, such as planning a garden layout or analyzing architectural features. Reflect on how geometric thinking has developed over the 10-day journey and identify areas for further exploration.",
      "primary_reading_focus": "Synthesis of geometric concepts, problem-solving applications, connections between different geometric areas, and preparation for advanced geometric study",
      "supplementary_readings": [
        {
          "doi": "N/A",
          "isbn": "9780395470923",
          "year": "1991",
          "focus": "Comprehensive problems that integrate multiple geometric concepts and develop reasoning skills",
          "title": "Geometry for Enjoyment and Challenge - Integration and Problem Solving",
          "author": "Richard Rhoad, George Milauskas, and Robert Whipple",
          "journal": "Book Chapter",
          "publisher": "McDougal Littell",
          "reading_time": "18 minutes"
        }
      ]
    }
  ],
  "primary_resource": {
    "isbn": "9781285195698",
    "year": "2014",
    "title": "Elementary Geometry for College Students",
    "author": "Daniel C. Alexander and Geralyn M. Koeberlein",
    "publisher": "Cengage Learning"
  },
  "executive_overview": "This 10-day geometry curriculum is designed for novice learners to develop foundational geometric understanding through a conceptual approach centered on visual recognition, spatial reasoning, and logical thinking. Using Alexander and Koeberlein's comprehensive textbook as the primary resource, the curriculum integrates classical Euclidean methods, hands-on discovery learning, and problem-solving approaches to build geometric literacy from the ground up. The program follows the Van Hiele model of geometric thinking, progressing from visual recognition (Level 0) toward basic analysis (Level 1) and informal deduction. Each day builds systematically on previous knowledge, ensuring learners develop both spatial intuition and mathematical reasoning skills essential for geometric understanding.",
  "knowledge_framework": {
    "synthesis_goals": "By the end of the curriculum, learners will have developed geometric literacy that enables them to analyze spatial relationships, communicate using geometric language, apply measurement concepts to real-world problems, and use geometric reasoning to solve complex spatial problems. This foundation prepares students for formal geometry study, practical applications in design and construction, and mathematical reasoning in other areas.",
    "advanced_applications": "Students develop geometric reasoning abilities that prepare them for formal proof concepts, coordinate geometry, and geometric problem-solving. Advanced applications include analyzing complex shape relationships, applying measurement to practical problems, using congruence for logical reasoning, and integrating multiple geometric concepts in comprehensive problem-solving scenarios.",
    "foundational_concepts": "The curriculum builds from visual recognition of geometric shapes (Van Hiele Level 0) through basic property analysis (Level 1), establishing spatial vocabulary, measurement skills, and logical reasoning patterns. Core foundations include understanding points, lines, and planes as geometric primitives; angle formation and measurement; polygon classification systems; circle properties; spatial relationships; and basic measurement concepts."
  },
  "visual_learning_path": {
    "day_1": "Foundation Building → Visual Recognition of Basic Shapes → Spatial Awareness Development",
    "day_2": "Point-Line-Plane Framework → Geometric Language → Position and Direction Concepts",
    "day_3": "Angle Formation → Measurement Concepts → Angular Relationships",
    "day_4": "Triangle Discovery → Classification Systems → Basic Properties",
    "day_5": "Polygon Exploration → Shape Families → Classification Principles",
    "day_6": "Circle Fundamentals → Curved Geometry → Central Concepts",
    "day_7": "Spatial Relationships → Distance and Position → Coordinate Thinking"
  },
  "resource_requirements": {
    "primary_book": {
      "isbn": "9781285195698",
      "year": "2014",
      "title": "Elementary Geometry for College Students",
      "author": "Daniel C. Alexander and Geralyn M. Koeberlein",
      "edition": "5th Edition",
      "publisher": "Cengage Learning"
    },
    "academic_papers": [
      {
        "doi": "10.1016/j.tate.2020.103038",
        "year": "2020",
        "title": "Examining the influence of van Hiele theory-based instructional activities on elementary preservice teachers' geometry knowledge for teaching 2-D shapes",
        "authors": "Minju Yi, Raymond Flores, Jian Wang",
        "journal": "Teaching and Teacher Education"
      },
      {
        "doi": "10.1063/1.5054479",
        "year": "2018",
        "title": "The Van Hiele theory and realistic mathematics education: As teachers' instruction for teaching geometry",
        "authors": "Saepul Watan, Sugiman",
        "journal": "AIP Conference Proceedings"
      },
      {
        "doi": "10.4102/pythagoras.v39i1.376",
        "year": "2018",
        "title": "Students' understanding of geometry terminology through the lens of Van Hiele theory",
        "authors": "Jogymol Alex, Kuttickattu J. Mammen",
        "journal": "Pythagoras"
      },
      {
        "doi": "10.1088/1742-6596/983/1/012148",
        "year": "2018",
        "title": "Exploring students' adaptive reasoning skills and van Hiele levels of geometric thinking: a case study in geometry",
        "authors": "H T N Rizki, D Frentika, A Wijaya",
        "journal": "Journal of Physics: Conference Series"
      },
      {
        "doi": "10.1016/j.sbspro.2010.12.169",
        "year": "2010",
        "title": "The effects of Google Sketchup based geometry activities and projects on spatial visualization ability of student mathematics teachers",
        "authors": "Aytaç Kurtulus, Candas Uygan",
        "journal": "Procedia Social and Behavioral Sciences"
      },
      {
        "doi": "10.26737/jetl.v3i1.552",
        "year": "2020",
        "title": "The Effect of Non-Routine Geometry Problem on Elementary Students Belief in Mathematics: A Case Study",
        "authors": "Khoerul Umam, Kowiyah Kowiyah",
        "journal": "Journal of Educational Technology and Learning"
      },
      {
        "doi": "10.15663/tandc.v20i1.344",
        "year": "2019",
        "title": "Observing the effects of hands-on activities on mathematics teacher confidence in geometry and statistics: A case study",
        "authors": "Zachariah Benton Hurdle",
        "journal": "Teaching and Learning in Communication Sciences & Disorders"
      }
    ],
    "equipment_needed": "Compass, protractor, ruler, graph paper, construction paper, scissors, colored pencils, string or yarn for geometric models, calculator (optional), access to academic papers through library or online databases",
    "total_reading_time": "10 hours (primary text: 7 hours, supplementary materials: 3 hours)",
    "supplementary_books": [
      {
        "isbn": "9780977985203",
        "year": "2006",
        "title": "Kiselev's Geometry / Book I. Planimetry",
        "author": "A. P. Kiselev",
        "publisher": "Sumizdat"
      },
      {
        "isbn": "9780130309631",
        "year": "2001",
        "title": "Experiencing Geometry",
        "author": "David W. Henderson",
        "publisher": "Prentice Hall"
      },
      {
        "isbn": "9780395470923",
        "year": "1991",
        "title": "Geometry for Enjoyment and Challenge",
        "author": "Richard Rhoad, George Milauskas, and Robert Whipple",
        "publisher": "McDougal Littell"
      }
    ]
  }
}